#ifndef C_DECORATOR__SCALE_H
#define C_DECORATOR__SCALE_H

//****************************************************************************************************
//Декоратор для изменения размеров изображения с использованием билинейной интерполяции
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "cdecorator_iimage.h"
#include <vector>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//Декоратор для изменения размеров изображения с использованием билинейной интерполяции
//****************************************************************************************************
class CDecorator_Scale:public CDecorator_IImage
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
  uint32_t Width;//ширина
  uint32_t Height;//высота
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CDecorator_Scale(IImage *iImage_Set_Ptr,uint32_t new_width,uint32_t new_height);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CDecorator_Scale();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  void GetRGBAImage(uint32_t &width,uint32_t &height,std::vector<uint32_t> &vector_image);//получить RGBA изображение
  void SetRGBAImage(const uint32_t &width,const uint32_t &height,const std::vector<uint32_t> &vector_image);//задать RGBA изображение
  void SetSize(uint32_t width,uint32_t height);//задать размер изображения и выделить память
  void SetRGBAPixel(uint32_t x,uint32_t y,uint32_t color);//задать точку
  uint32_t GetRGBAPixel(uint32_t x,uint32_t y);//получить точку
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
};



#endif
