#ifndef C_GRAPHICS_H
#define C_GRAPHICS_H

//****************************************************************************************************
//Класс рисования в буфере изображения
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <stdint.h>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//Класс рисования в буфере изображения
//****************************************************************************************************
class CGraphics
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
  static const int32_t FONT_WIDTH=8;
  static const int32_t FONT_HEIGHT=14;
 private:
  //-переменные-----------------------------------------------------------------------------------------
  uint32_t *VideoPtr;//указатель на видеобуфер (RGBA)
  int32_t ScreenWidth;//ширина изображения
  int32_t ScreenHeight;//высота изображения
  int32_t LineSize;//расмер строки изображения
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CGraphics(void);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CGraphics();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  void Init(uint32_t *video_ptr,int32_t screen_width,int32_t screen_height);//инициализация
  void PutSymbol(int32_t x,int32_t y,char symbol,uint32_t color);//вывод символа в позицию
  void PutString(int32_t x,int32_t y,const char *string,uint32_t color);//вывод строчки в позицию
  void SolidFill(int32_t x,int32_t y,int32_t width,int32_t height,uint32_t color);//закрасить прямоугольник
  void PutSymbolInversion(int32_t x,int32_t y,char symbol);//вывод символа в позицию с инверсией цвета
  void PutStringInversion(int32_t x,int32_t y,const char *string);//вывод строчки в позицию с инверсией цвета
  void DrawPointInversion(int32_t x,int32_t y);//поставить точку в позицию с инверсией цвета
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
};

#endif
