//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "clanguagerussian.h"

//****************************************************************************************************
//глобальные переменные
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//конструктор и деструктор
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//конструктор
//----------------------------------------------------------------------------------------------------
CLanguageRussian::CLanguageRussian(void)
{ 
}
//----------------------------------------------------------------------------------------------------
//деструктор
//----------------------------------------------------------------------------------------------------
CLanguageRussian::~CLanguageRussian()
{
}

//****************************************************************************************************
//закрытые функции
//****************************************************************************************************


//****************************************************************************************************
//открытые функции
//****************************************************************************************************

std::string CLanguageRussian::WindowTitle(void)
{
 return("Управление тепловизором Flir One");
}
std::string CLanguageRussian::Label_Emission(void)
{
 return("Коэффициент излучения материала");
}
std::string CLanguageRussian::Label_Temper(void)
{
 return("Температура болометров");
}
std::string CLanguageRussian::Label_Palette(void)
{
 return("Палитра");
}
std::string CLanguageRussian::Label_Alarm(void)
{
 return("При выходе за границы температуры выполнить:");
}
std::string CLanguageRussian::Button_ApplyPalette(void)
{
 return("Применить палитру");
}
std::string CLanguageRussian::Button_ShowVideo(void)
{
 return("Показывать видео");
}
std::string CLanguageRussian::Button_SaveImageCross(void)
{
 return("Сохранять кадры с перекрестьем");
}
std::string CLanguageRussian::Button_SaveImageNoScale(void)
{
 return("Сохранять изображения без шкалы");
}
std::string CLanguageRussian::Button_SaveRAW(void)
{
 return("Сохранять файл RAW");
}
std::string CLanguageRussian::Button_SaveVideo(void)
{
 return("Сохранять кадры с видеокамеры");
}
std::string CLanguageRussian::Button_SaveAllFrame(void)
{
 return("Сохранять все кадры");
}
std::string CLanguageRussian::Button_SaveFrame(void)
{
 return("Сохранить один кадр");
}
std::string CLanguageRussian::Label_LevelMinT(void)
{
 return("Нижняя граница температуры для сигнализации");
}
std::string CLanguageRussian::Label_LevelMaxT(void)
{
 return("Верхняя граница температуры для сигнализации");
}
std::string CLanguageRussian::CheckBox_SaveFrame(void)
{
 return("Сохранить кадр");
}

