#ifndef I_LANGUAGE_H
#define I_LANGUAGE_H

//****************************************************************************************************
//Интерфейс класса сообщений
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <string>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//Интерфейс класса сообщений
//****************************************************************************************************
class ILanguage
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
 public:
  //-деструктор-----------------------------------------------------------------------------------------
  virtual ~ILanguage() {}
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  virtual std::string WindowTitle(void)=0;
  virtual std::string Label_Emission(void)=0;
  virtual std::string Label_Temper(void)=0;
  virtual std::string Label_Palette(void)=0;
  virtual std::string Label_Alarm(void)=0;
  virtual std::string Button_ApplyPalette(void)=0;
  virtual std::string Button_ShowVideo(void)=0;
  virtual std::string Button_SaveImageCross(void)=0;
  virtual std::string Button_SaveImageNoScale(void)=0;
  virtual std::string Button_SaveRAW(void)=0;
  virtual std::string Button_SaveVideo(void)=0;
  virtual std::string Button_SaveAllFrame(void)=0;
  virtual std::string Button_SaveFrame(void)=0;
  virtual std::string Label_LevelMinT(void)=0;
  virtual std::string Label_LevelMaxT(void)=0;
  virtual std::string CheckBox_SaveFrame(void)=0;
  //-открытые статические функции-----------------------------------------------------------------------
};

#endif
